<template>
  <div class="g-form-checkbox">
    <el-checkbox v-model="checked"><el-button type="text" @click="dialogVisible = true">同意爱风商城协议</el-button></el-checkbox>
    <el-dialog title="爱风协议" :visible.sync="dialogVisible" size="large" :before-close="handleClose">
      <p>第一章 爱风商城注册协议</p>
      <p>第一条 在使用爱风商城（以下简称“本商城”，注册网址是：http://www.afwind.com/）服务之前，用户（以下简称“您”）应当认真阅读并遵守《电商金融平台用户注册协议》（以下简称“本协议”）。请您仔细阅读本协议，充分理解各条款内容，如您对协议有任何疑问的，应向本商城客服咨询。您点击"立即注册"按钮后，即视为您接受并同意遵守本协议的约定。</p>
      <p>第二条 当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他平台允许的方式实际使用本商城服务时，即表示您已充分阅读、理解并接受本协议的全部内容，并与本商城达成协议。您承诺接受并遵守本协议的约定，届时您不应以未阅读本协议的内容或者未获得本商城对您问询的解答等理由，主张本协议无效，或要求撤销本协议。</p>
      <p>第二章 概述</p>
      <p>第三条 本协议由您与本商城共同缔结，具有合同效力。</p>
      <p>第四条 除另行明确声明外，本商城服务包含任何本商城及其关联公司提供的基于互联网以及移动互联网的相关服务，且均受本协议约束。如果您不同意本协议的约定，您应立即停止注册/激活程序或停止使用本商城服务。</p>
      <p>第五条  本协议内容包括协议正文、《商城规则总则》、实施细则及所有商城已经发布或将来可能发布的各类规则、公告或通知（以下合称“商城规则”或“规则”）。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。</p>
      <p>第六条 本商城有权利根据需要调整协议的条款，如本协议有任何变更，本商城将在网站上刊载公告，以公告方式变更，以邮件方式通知注册会员。注册会员可随时登录或查收邮件查阅最新协议；注册会员有义务不时关注并阅读最新版的协议及平台公告。注册会员对新修改的条款如有异议，履行完未完成的责任义务后可停止使用本商城提供的服务，并申请退出本商城。一旦注册会员继续使用本商城提供的服务，则表示注册会员已经接受了修订的条款。注册会员与本商城发生争议时，解决争议应以本协议的最新的版本为准。</p>
      <p>第三章 注册</p>
      <p>第七条 注册资格</p>
      <p>在您完成注册程序或以其他本商城允许的方式实际使用本商城服务时，您应当是具备完全民事行为能权利能力和完全民事力的自然人、法人或其他组织。若您不具备前述注册资格，则您及您的监护人应承担因此而导致的一切后果，且本商城有权注销或永久冻结您的账户，并向您及您的监护人索偿相应损失。</p>
      <p>第八条 注册账户</p>
      <p>（一）当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他平台允许的方式实际使用本商城服务时，您即受本协议约束。您可以使用您提供或确认的登录名、邮箱、手机号码或者本商城允许的其它方式作为登录手段进入本商城。</p>
      <p>（二）您可以对账户设置本商城登录名，您也可以通过平台登录名登录本商城。您设置的登录名不得侵犯或涉嫌侵犯他人合法权益。如您设置的登录名涉嫌侵犯他人合法权益，本商城有权终止向您提供平台服务，并注销您的账户。账户注销后，相应的登录名将开放给其他用户登记使用。</p>
      <p>（三）您的登录名和密码不得以任何方式买卖、转让、赠与或继承，除非有法律明确规定或司法裁定，并经本商城同意，且需提供本商城要求的合格的文件材料并根据本商城制定的操作流程办理。</p>
      <p>（四）您同意：您选择向本站的商户提交订单购买商品或服务，视为您向商户披露个人相关信息，接受商户向您提供商品销售、配送、售后服务、客户服务、处理信用卡付款、数据分析、市场营销帮助或其他必要事宜；如前述全部或部分事宜之一涉及由商户外的第三方履行的，商户有权将您的信息以必要方式向第三方披露，第三方有权以履行上述事宜为目的联系您。</p>
      <p>第九条 用户信息</p>
      <p>（一）在注册或激活流程时，您应当依照法律法规要求，按相应页面的提示准确提供您的资料，资料信息变更时及时更新，以保证您所提交资料的真实、及时、完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，本商城有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部平台服务。本商城对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。</p>
      <p>（二）您应当准确填写并及时更新您提供的电子邮件地址、联系电话等会员信息，以便本商城或其他用户与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用本商城服务过程中产生任何损失或增加费用的，应由您完全独自承担。您了解并同意，您有义务保持你提供的联系方式的真实性和有效性，如有变更或需要更新的，您应按本商城的要求进行操作。</p>
      <p>第十条 账户安全</p>
      <p>您须自行负责对您的本商城登录名、密码保密和其他会员信息，且须对您在该登录名、密码和其他会员信息下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。您同意：①如发现任何人未经授权使用您的平台登录名和密码，或发生违反保密规定的任何其他情况，您会立即通知本商城，并授权本商城将该信息同步给平台网站；②确保您在每个上网时段结束时，以正确步骤离开本商城。本商城不能也不会对因您未能遵守本款规定而发生的任何损失负责。您理解本商城对您的请求采取行动需要合理时间，本商城对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。</p>
      <p>第十一条 账户注销</p>
      <p>（一）如您连续12个月未使用您的登录名、邮箱、手机或本商城认可的其他方式和密码登录过本商城，且您的账户下不存在未到期的有效业务，您的登录名可能被注销，不能再登录本商城，所有本商城服务同时终止。</p>
      <p>（二）您同意并授权本商城，您如在本商城发生欺诈、发布或销售假冒伪劣/侵权商品、侵犯他人合法权益或其他违反法律法规、本商城网站规则等行为，本商城对此有权披露，您的本商城登录账户可能被冻结或注销、不能再登录本商城，所有本商城服务同时终止。</p>
      <p>第四章 平台服务</p>
      <p>第十二条 根据本商城的注册流程完成注册，成为本商城会员后可以享受本商城提供的平台服务，会员可在本商城上创建会员账户、发布交易信息、查询金融产品和服务信息、提交服务申请或提供服务、达成金融交易并进行交易、参加平台组织的活动以及使用其他信息服务及技术服务，具体以本商城提供的服务内容为准。</p>
      <p>第十三条 您在本商城上交易过程中与其他会员发生交易纠纷时，一旦您或其它会员任一方或双方共同提交本商城要求调处，则本商城作为独立第三方，有权根据单方判断做出调处决定，您了解并同意接受本商城的判断和调处决定。</p>
      <p>第十四条 您了解并同意，本商城有权应政府部门（包括司法及行政部门）的要求，向其提供您向本商城提供的用户信息和交易记录等必要信息。如您涉嫌侵犯他人合法权益，则本商城亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。</p>
      <p>第十五条 您在使用本商城服务过程中，所产生的应纳税赋，以及一切硬件、软件、服务及其它方面的费用，均由您独自承担。</p>
      <p>第十六条 本商城仅作为会员物色交易对象，就商品的交易进行协商，以及获取各类与贸易相关服务的场所。本商城不涉及会员间因交易而产生的法律关系及法律纠纷，不会且不能牵涉进交易各方的交易当中。</p>
      <p>第十七条 您了解本商城上的信息系会员自行发布，且可能存在风险和瑕疵。本商城无法控制交易所涉及的物品的质量、安全或合法性，商贸信息的真实性或准确性，以及交易各方履行其在贸易协议中各项义务的能力。您应注意到，与以欺诈手段行事的人进行交易的风险是客观存在的。本商城希望您在使用本商城网站时，小心谨慎并运用常识。您应自行谨慎判断确定相关物品及/或信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。</p>
      <p>第十八条 您理解并同意，本商城或本商城授权的第三方或您与本商城一致同意的第三方并非司法机构，仅能以普通人的身份对证据进行鉴别，本商城或本商城授权的第三方或您与本商城一致同意的第三方对争议的调处完全是基于您不可撤销的授权，其无法保证争议处理结果符合您的期望，也不对争议调处结论承担任何责任。如您因此遭受损失，您同意自行向受益人索偿。</p>
      <p>第十九条 您了解并同意，本商城不对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿(无论本商城是否已被告知该等损害赔偿的可能性)：</p>
      <p>（一）使用或未能使用本商城服务；</p>
      <p>（二）第三方未经批准的使用您的账户或更改您的数据；</p>
      <p>（三）通过本商城服务购买或获取任何商品、样品、服务、数据、信息或进行交易等行为或替代行为产生的费用及损失；</p>
      <p>（四）您对本商城服务的误解；</p>
      <p>（五）任何非因本商城的原因而引起的与本商城服务有关的其它损失。</p>
      <p>第二十条 不论在何种情况下，本商城均不对由于信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。</p>
      <p>第二十一条 请确保您的资料真实完整</p>
      <p>（一）“您的资料”包括您在注册、发布信息或交易等过程中、在任何公开信息场合或通过任何电子邮件形式，向本商城或其他用户提供的任何资料，包括数据、文本、软件、音乐、声响、照片、图画、影像、词句或其他材料。您应对“您的资料”负全部责任，而本商城仅作为您在网上发布和刊登“您的资料”的被动渠道；</p>
      <p>（二）您同意并承诺，“您的资料”和您在本商城上交易的任何“商品”（泛指一切可供依法交易的、有形的或无形的、以各种形态存在的某种具体的商品，或某种权利或利益，或某种服务或行为。本协议中“商品”一词均含此义）：</p>
      <p>（1）不会有欺诈成份，与售卖伪造或盗窃无涉；</p>
      <p>（2）不会侵犯任何第三者对该商品享有的物权，或版权、专利、商标、商业秘密或其他知识产权，或隐私权、名誉权；</p>
      <p>（3）不会违反任何法律、法规、条例或规章(包括但不限于关于规范出口管理、凭许可证经营、贸易配额、保护消费者、不正当竞争或虚假广告的法律、法规、条例或规章)、本协议及相关规则；</p>
      <p>（4）不会含有诽谤（包括商业诽谤）、非法恐吓或非法骚扰的内容；</p>
      <p>（5）不会含有淫秽、或包含任何儿童色情内容；</p>
      <p>（6）不会含有蓄意毁坏、恶意干扰、秘密地截取或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或其他电脑程序；</p>
      <p>（7）不会直接或间接与下述各项货物或服务连接，或包含对下述各项货物或服务的描述：①本协议项下禁止的货物或服务；或②您无权连接或包含的货物或服务。此外，您同意不会：③在与任何连锁信件、大量胡乱邮寄的电子邮件、滥发电子邮件或任何复制或多余的信息有关的方面使用“服务”；④未经其他人士同意，利用“服务”收集其他人士的电子邮件地址及其他资料；或⑤利用“服务”制作虚假的电子邮件地址，或以其他形式试图在发送人的身份或信息的来源方面误导其他人士；</p>
      <p>（8）不含有本商城认为应禁止或不适合通过本商城网站宣传或交易。</p>
      <p>（三）您同意，您不会对任何资料作商业性利用，包括但不限于在未经本商城事先书面批准的情况下，复制在本商城网站上展示的任何资料并用于商业用途。</p>
      <p>第二十二条 在本商城上进行正规的交易</p>
      <p>（一）添加产品描述 产品描述是由您提供的在本商城网站上展示的文字描述、图画和/或照片，可以是对您拥有而您希望出售的产品的描述；或对您正寻找的产品的描述。您须将该等产品描述归入正确的品类内。本商城不对产品描述的准确性或内容负责。</p>
      <p>（二）不得操纵交易 您同意不利用帮助实现蒙蔽或欺骗意图的客户或第三方，操纵与另一交易方所进行的商业谈判的结果。</p>
      <p>（三）不得干扰交易系统 您同意，您不得使用任何装置、软件或例行程序干预或试图干预本商城的正常运作或正在本商城上进行的任何交易。您不得采取对任何将不合理或不合比例的庞大负载加诸平台网络结构的行动。</p>
      <p>（四）关于交易反馈 您不得采取任何可能损害信息反馈系统的完整性的行动，诸如：利用第二会员身份标识或第三者为您本身留下正面反馈；利用第二会员身份标识或第三者为其他用户留下负面反馈(反馈数据轰炸)；或在用户未能履行交易范围以外的某些行动时，留下负面的反馈(反馈恶意强加)。</p>
      <p>（五）关于处理交易争议</p>
      <p>1、本商城不涉及用户间因交易而产生的法律关系及法律纠纷，不会且不能牵涉进交易各方的交易当中。倘若您与一名或一名以上会员，或与您通过本商城获取其服务的第三者服务供应商发生争议，您免除本商城(及本商城代理人和雇员)在因该等争议而引起的，或在任何方面与该等争议有关的不同种类和性质的任何(实际和后果性的)权利主张、要求和损害赔偿等方面的责任。</p>
      <p>1、本商城不涉及用户间因交易而产生的法律关系及法律纠纷，不会且不能牵涉进交易各方的交易当中。倘若您与一名或一名以上会员，或与您通过本商城获取其服务的第三者服务供应商发生争议，您免除本商城(及本商城代理人和雇员)在因该等争议而引起的，或在任何方面与该等争议有关的不同种类和性质的任何(实际和后果性的)权利主张、要求和损害赔偿等方面的责任。</p>
      <p>第二十三条 违反规则的后果。以下条款对金融服务是否适用，或是否需要特别制定，需要研究。</p>
      <p>（一）倘若本商城认为“您的资料”可能使本商城承担任何法律或道义上的责任，或可能使本商城(全部或部分地)失去平台的互联网服务供应商或其他供应商的服务，则本商城可自行全权决定对“您的资料”采取本商城认为必要或适当的任何行动，包括但不限于删除该类资料。您特此保证，您对提交给本商城的“您的资料”拥有全部权利，包括全部版权。您确认，本商城没有责任去认定或决定您提交给本商城的资料哪些是应当受到保护的，对享有“服务”的其他用户使用“您的资料”，本商城也不必负责。</p>
      <p>（二）对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保本商城免责。</p>
      <p>（三）在不限制其他补救措施的前提下，发生下述任一情况，本商城可立即发出警告，暂时中止、永久中止或终止您的会员资格，删除您的任何现有产品信息，以及您在本商城上展示的任何其他资料：①您违反本协议；②本商城无法核实或鉴定您向本商城提供的任何资料；③本商城相信您的行为可能会使您、本商城用户或通过本商城或本商城提供服务的第三者服务供应商发生任何法律责任。在不限制任何其他补救措施的前提下，若发现您从事涉及本商城网站的诈骗活动，本商城可暂停或终止您的账户。</p>
      <p>（四）经生效法律文书确认用户存在违法或违反本协议行为或者本商城自行判断用户涉嫌存在违法或违反本协议行为的，本商城有权在本商城上以网络发布形式公布用户的违法行为并做出处罚（包括但不限于限权、终止服务等）。</p>
      <p>第五章 会员义务</p>
      <p>第二十四条 在使用本商城服务过程中，您承诺遵守以下约定：</p>
      <p>（一）您在本商城上的所有行为均遵守国家法律、法规等规范性文件及本商城各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不偷逃应缴税费，不违反本协议及相关规则。不得传输或发表：煽动抗拒、煽动颠覆国家政权，推翻社会主义制度、煽动分裂国家、破坏国家统一、煽动民族仇恨、民族歧视、破坏民族团结的言论；</p>
      <p>（二）在与其他会员交易过程中，遵守诚实信用原则，不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与交易无关的行为；</p>
      <p>（三）不发布国家禁止销售的或限制销售的商品或服务信息（除非取得合法且足够的许可），不发布涉嫌侵犯他人知识产权或其它合法权益的商品或服务信息，不发布违背社会公共利益或公共道德或本商城认为不适合在本商城上销售的商品或服务信息，不发布其它涉嫌违法或违反本协议及本商城规则的信息；</p>
      <p>（四）不以虚构或歪曲事实的方式不当评价其他会员，不采取不正当方式制造或提高自身的信用度，不采取不正当方式制造或提高（降低）其他会员的信用度；</p>
      <p>（五）不对本商城上的任何数据作商业性利用，包括但不限于在未经本商城事先书面同意的情况下，以复制、传播等任何方式使用本商城上展示的资料；</p>
      <p>（六）不使用任何装置、软件或例行程序干预或试图干预本商城的正常运作或正在本商城上进行的任何交易、活动。您不得采取任何将导致不合理的庞大数据负载加诸本商城网络设备的行动；</p>
      <p>（七）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料。</p>
      <p>第二十五条 您了解并同意承担因违反承诺产生的以下后果：</p>
      <p>（一）您如果违反前述承诺，本商城有权做出独立判断并冻结或关闭您的账户、冻结账户相关支付账户内余额及其他优惠、关闭相应交易订单等措施。产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保本商城免于因此产生任何损失或增加费用；</p>
      <p>（二）基于维护本商城交易秩序及交易安全的需要，本商城有权在发生恶意购买等扰乱市场正常交易秩序的情形下，执行关闭相应交易订单等操作；</p>
      <p>（三）经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者本商城根据自身的判断，认为您的行为涉嫌违反法律法规的规定或涉嫌违反本协议和/或规则的条款的，则本商城有权在本商城上公示您的该等涉嫌违法或违约行为及本商城已对您采取的措施；</p>
      <p>（四）对于您在本商城上发布的涉嫌违法、涉嫌侵犯他人合法权利或违反本协议和/或规则的信息，本商城有权不经通知您即予以删除，且按照规则的规定进行处罚；</p>
      <p>（五）对于您违反本协议项下承诺，或您在本商城上实施的行为，包括您未在本商城上实施但已经对平台及其用户产生影响的行为，本商城有权单方认定您行为的性质及是否构成对本协议和/或规则的违反，并根据单方认定结果适用规则予以处理或终止向您提供服务，且无须征得您的同意或提前通知予您。您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果；</p>
      <p>（六）如您涉嫌违反有关法律或者本协议之规定，使本商城遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿本商城因此造成的损失和/或发生的费用，包括合理的律师费用。</p>
      <span slot="footer" class="dialog-footer">
            <el-button @click="dialogVisible = false">取 消</el-button>
            <el-button type="primary" @click="dialogVisible = false">确 定</el-button>
          </span>
    </el-dialog>
  </div>
</template>

<script>
export default {
  data(){
    return {
      checked: true,
      dialogVisible: false
    }
  },
  watch:{
    checked(){
      this.$emit('regstatus',this.regdisable)
    }
  },
  methods: {
    handleClose(done) {
      this.$confirm('确认关闭？')
        .then(_ => {
          done();
        })
        .catch(_ => {});
    }
  }
}
</script>

<style>

</style>
